config/doom/config-personal-org-agenda.org
:PROPERTIES:
:LAST_MODIFIED: [2026-06-01 Mon 12:25]
:END:
#+title: Personal Emacs config: Org - Agenda
#+author: Cash Prokop-Weaver
#+EMAIL: cashbweaver@gmail.com
#+STARTUP: showeverything

* Agenda
** Agenda files

#+begin_src emacs-lisp :tangle config-personal.el :results none
(defun cashpw/org-agenda-files--notes-all ()
  "Return list of all notes files.

Don't call directly. Use `cashpw/org-agenda-files'."
  (let* ((org-roam-directory cashpw/path--notes-dir)
         (org-roam-db-location (expand-file-name "org-roam.db"
                                                 org-roam-directory)))
    (org-roam-list-files)))

(defun cashpw/org-agenda-files--journal-this-year ()
  "Return list of journal agenda files.

Don't call directly. Use `cashpw/org-agenda-files'."
  (let* ((org-roam-directory cashpw/path--notes-dir)
         (org-roam-db-location (expand-file-name "org-roam.db"
                                                 org-roam-directory))
         (yyyy (format-time-string "%Y" (current-time))))
    (--filter
     (string-match-p yyyy it)
     (cashpw/notes-files-with-tag "journal"))))

(defun cashpw/org-agenda-files--journal-this-year-with-todo ()
  "Return list of journal agenda files.

Don't call directly. Use `cashpw/org-agenda-files'."
  (let* ((org-roam-directory cashpw/path--notes-dir)
         (org-roam-db-location (expand-file-name "org-roam.db"
                                                 org-roam-directory))
         (yyyy (format-time-string "%Y" (current-time))))
    (--filter
     (string-match-p yyyy it)
     (cashpw/notes-files-with-tags "journal" "hastodo"))))

(defun cashpw/org-agenda-files (context &optional include-archive)
  "Return list of agenda files for CONTEXT. Include archived files when INCLUDE-ARCHIVE."
  (let ((files
         (cond
          ((equal context 'notes-with-todo)
           (cashpw/notes-files-with-tag "hastodo"))
          ((equal context 'notes-all)
           (cashpw/org-agenda-files--notes-all))
          ((equal context 'personal)
           (append
            `(,(cashpw/path-todos)
              ,cashpw/path--personal-asana
              ,(cashpw/path-calendar))))
          ((equal context 'projects-with-todo)
           (cashpw/notes-files-with-tags "hastodo" "project"))
          ((equal context 'pets-with-todo)
           (cashpw/notes-files-with-tags "hastodo" "pet"))
          ((equal context 'calendar)
           '())
          ((equal context 'journal-this-year)
           (cashpw/org-agenda-files--journal-this-year))
          ((equal context 'journal-this-year-with-todo)
           (cashpw/org-agenda-files--journal-this-year-with-todo))
          ((equal context 'people-private-with-todo)
           (cashpw/notes-files-with-tags "person" "private" "hastodo"))
          ((equal context 'people-private)
           (cashpw/notes-files-with-tags "person" "private")))))
    (if include-archive
        (append
         files
         (org-extras-files-archive-files files))
      files)))

(defun cashpw/org-agenda-files--update ()
  "Update `org-agenda-files'."
  (setq
   org-agenda-files
   (seq-uniq
    (append
     (cashpw/org-agenda-files 'personal)
     (cashpw/org-agenda-files 'calendar)
     (cashpw/org-agenda-files 'projects-with-todo)
     (cashpw/org-agenda-files 'pets-with-todo)
     (cashpw/org-agenda-files 'journal-this-year-with-todo)
     (cashpw/org-agenda-files 'people-private-with-todo)))))

(cashpw/org-agenda-files--update)
#+end_src

** Method

I continue to iterate on this TODO management method which is a combination of [[wikipedia:Getting_Things_Done][Getting Things Done]] and what I've found that works for me.

TODOs come from (1) captures and (2) my calendar via =org-gcal=. TODOs are in the Inbox unless they meet one of the following criteria:

1. Tagged with =someday=

   Example: Read a book a friend recommended to me.

2. Tagged with =reminder=

   Example: Someone's birthday.

3. They are 'specified'; they have the following properties:

   - An =Effort= of less than four hours
   - An explicit =CATEGORY=
   - A start date/time in =SCHEDULED=
   - (optional) An end date/time in =DEADLINE=
** Config

#+begin_src emacs-lisp :tangle config-personal.el :results none
(use-package! org-agenda)
(use-package! evil-org-agenda)
(use-package! org-super-agenda
  :demand t

  :after (:all org-agenda
               evil
               evil-org-agenda)
  :hook
  ((org-agenda-mode . org-super-agenda-mode))

  :custom
  (org-agenda-prefix-format
   '((agenda . " %i %-30(cashpw/org-agenda-category 30)%?-12t%-6e% s")
     (todo . " %i %-30(cashpw/org-agenda-category 30) %-6e %-40(cashpw/org-agenda-buganizer-title)")
     (tags . " %i %-12c")
     (search . " %i %-12c")))
  (org-agenda-log-mode-items
   '(state
     closed
     clock))
  (org-super-agenda-header-map
   evil-org-agenda-mode-map)
  ;; https://emacs.stackexchange.com/a/17128
  (org-agenda-sorting-strategy
   '((agenda time-up priority-down category-keep)
     (todo priority-down category-keep)
     (tags priority-down category-keep)
     (search category-keep)))

  :config
  (setq org-super-agenda-header-map evil-org-agenda-mode-map)
  (cl-defun org-super-agenda--group-dispatch-take (items (n group))
    ;;(cl-defun org-super-agenda--group-dispatch-take (items n-and-group)
    "Take N ITEMS that match selectors in GROUP.
If N is positive, take the first N ITEMS, otherwise take the last N ITEMS.
Note: the ordering of entries is not guaranteed to be preserved, so this may
not always show the expected results."
    (-let* (((name non-matching matching) (org-super-agenda--group-dispatch items group))
            (take-fn (if (cl-minusp n) #'-take-last #'-take))
            (placement (if (cl-minusp n) "Last" "First"))
            (name (format "%s %d %s" placement (abs n) name)))
      (list name non-matching (funcall take-fn (abs n) matching)))))

(defun cashpw/org-super-agenda--get-priority (item)
  "'org-super-agenda' `:auto-map'-compatible for the given ITEM."
  (-when-let* ((marker (or (get-text-property 0 'org-marker item)
                           (get-text-property 0 'org-hd-marker)))
               (default-priority "?")
               (priority (or (org-extras-get-priority marker)
                             default-priority)))
    (s-lex-format "p${priority}")))

(defun cashpw/org-super-agenda--get-bug-id (item)
  "'org-super-agenda' `:auto-map'-compatible for the given ITEM."
  (-when-let* ((marker (or (get-text-property 0 'org-marker item)
                           (get-text-property 0 'org-hd-marker)))
               (bug-id (or (org-extras-get-property marker "buganizer_id")
                             "?")))
    (s-lex-format "http://b/${bug-id}")))

(defun cashpw/org-super-agenda--get-heading (item)
  "'org-super-agenda' `:auto-map'-compatible for the given ITEM."
  (-when-let* ((marker (or (get-text-property 0 'org-marker item)
                           (get-text-property 0 'org-hd-marker))))
     (org-entry-get marker "ITEM")))

(defun cashpw/org-super-agenda--get-category (item)
  "'org-super-agenda' `:auto-map'-compatible for the given ITEM."
  (-when-let* ((marker (or (get-text-property 0 'org-marker item)
                           (get-text-property 0 'org-hd-marker))))
    (org-get-category marker)))

(defun cashpw/org-super-agenda--get-first-n-from-roam-tag (n tag)
  "Return plist to group the first N headings tagged TAG.

Intended for use with `org-super-agenda-groups'."
  `(:name ,(s-lex-format "${tag} (${n})")
    :transformer (replace-regexp-in-string "TODO " ""
                                           (replace-regexp-in-string "\\[#[0-9]\\] " "" it))
    :take (,n (:tag ,tag))))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el :results none
(after! org
  :config
  (setq
   calendar-week-start-day 1
   org-agenda-entry-text-maxlines 30
   org-agenda-entry-text-leaders "  "
   org-agenda-time-grid '((daily
                           today
                           require-timed
                           ;; remove-match
                           )
                          (500 600 700 800 900 1000 1100 1200 1300 1400 1500 1600 1700 1800 1900 2000)
                          ;; (800 1000 1200 1400 1600 1800 2000)
                          "......" "----------------")
   ))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el :results none
(defun cashpw/org-mode-buffer-property-get (property-name)
  "Return the value of buffer-level Org-mode property PROPERTY-NAME."
  (org-with-point-at 1
    (when (re-search-forward
           (concat "^#\\+" property-name ": \\(.*\\)")
           (point-max) t)
      (buffer-substring-no-properties
       (match-beginning 1)
       (match-end 1)))))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el :results none
(after! org-agenda
  (setq
   org-duration-units `(("m" . 1)
                        ("min" . 1)
                        ("mins" . 1)
                        ("h" . 60)
                        ("d" . ,(* 60 24))
                        ("w" . ,(* 60 24 7))
                        ("mo" . ,(* 60 24 30))
                        ("mos" . ,(* 60 24 30))
                        ("M" . ,(* 60 24 30))
                        ("y" . ,(* 60 24 365.25)))
   org-agenda-skip-scheduled-if-deadline-is-shown t
   org-agenda-skip-scheduled-if-done t
   org-agenda-skip-scheduled-if-done t
   org-agenda-skip-deadline-if-done t
   org-agenda-include-deadlines t
   org-agenda-block-separator nil
   org-agenda-compact-blocks t
   org-agenda-start-day nil ;; i.e. today
   org-agenda-span 3
   org-agenda-include-diary t
   org-agenda-start-on-weekday nil))
#+end_src
** Helper functions
*** Set views

#+begin_src emacs-lisp :tangle config-personal.el :results none
(defun cashpw/org-agenda-custom-commands--update ()
  "Update `org-agenda-custom-commands'."
  (setq
   org-agenda-custom-commands `((".inbox" "Inbox" ,(cashpw/org-agenda-view--inbox))
                                (".overdue" "Overdue" ,(cashpw/org-agenda-view--overdue))
                                (".gallery" "Gallery" ,(cashpw/org-agenda-view--gallery))
                                (".gallery-all" "Gallery (all)" ,(cashpw/org-agenda-view--gallery-all))
                                (".gallery-photos" "Gallery (photos)" ,(cashpw/org-agenda-view--gallery-photos))
                                (".gallery-current-buffer" "Gallery (current buffer)" ,(cashpw/org-agenda-view--gallery-current-buffer))
                                (".plan-week" "Week" ,(cashpw/org-agenda-view--plan--week))
                                (".review-clockcheck" "Clock check" ,(cashpw/org-agenda-view--review--clockcheck))
                                (".review-clockreport" "Clock report" ,(cashpw/org-agenda-view--review--clockreport))
                                (".review-logged" "Logged" ,(cashpw/org-agenda-view--review-logged))
                                (".review-logged-today" "Logged" ,(cashpw/org-agenda-view--review-logged-today))
                                (".roam-roam" "Roam" ,(cashpw/org-agenda-view--roam--roam))
                                (".roam-readinglist" "Reading list" ,(cashpw/org-agenda-view--roam--readinglist))
                                (".today" "Today" ,(cashpw/org-agenda-view--today)
                                 ((org-agenda-compact-blocks nil)
                                  (org-agenda-block-separator "")))
                                (".habits" "Habits" ,(cashpw/org-agenda-view--habits))
                                (".without-effort" "Without effort" ,(cashpw/org-agenda-view--no-effort))
                                (".without-priority" "Priority" ,(cashpw/org-agenda-view--no-priority))
                                (".without-scheduled" "Not scheduled" ,(cashpw/org-agenda-view--not-scheduled)))))

(defun cashpw/org-agenda-custom-commands--maybe-update ()
  "Update when all functions are defined."
  (when cashpw/personal-config-loaded-p
    (cashpw/org-agenda-custom-commands--update)))

(defvar cashpw-org-agenda-next-week-tag nil
  "Dynamic variable to cache next week's tag during agenda generation.")

(defun cashpw/org-agenda-custom-commands-wrap (orig-fn &rest args)
  "Update custom commands and bind next-week tag dynamically."
  (cashpw/org-agenda-custom-commands--update)
  (let ((cashpw-org-agenda-next-week-tag (cashpw-time-next-week-tag)))
    (apply orig-fn args)))

(advice-add 'org-agenda :around #'cashpw/org-agenda-custom-commands-wrap)
#+end_src
*** Transform

#+begin_src emacs-lisp :tangle config-personal.el :results none
(defun cashpw/org-agenda--simplify-line (line)
  "Return LINE without frills."
  (-->
   line
   (cashpw/org-agenda--remove-priorities it)
   (cashpw/org-agenda--remove-todo it)))

(defun cashpw/org-agenda--remove-priorities (line)
  "Return LINE without priorities."
  (--> line (replace-regexp-in-string "\\[#[0-9]\\] " "" it)))

(defun cashpw/org-agenda--remove-todo (line)
  "Return LINE without todo."
  (--> line (replace-regexp-in-string "TODO " "" it)))

(defun cashpw/org-super-agenda--simplify-map (group)
  "Return GROUP after simplifying each line.

GROUP is a plist of the form `(:name ... :items ...)'.

Intended for use with `org-super-agenda' `:transformer'. "
  (plist-put
   group
   :items
   (--map (cashpw/org-agenda--simplify-line it) (plist-get group :items))))

(defun cashpw/org-super-agenda--remove-todo-map (group)
  "Return GROUP after simplifying each line.

GROUP is a plist of the form `(:name ... :items ...)'.

Intended for use with `org-super-agenda' `:transformer'. "
  (plist-put
   group
   :items (--map (cashpw/org-agenda--remove-todo it) (plist-get group :items))))

(defun cashpw/org-agenda--dim-line (line)
  "Dim color/brightness of LINE."
  (propertize line 'face 'shadow))

(setq cashpw/org-agenda--dim-headline-regexps
  '(
    ;; "Stretch"
    "Slack"
    "Huel"
    "Meditate"
    "Stretch"
    "Train Finn"
    ;; "Shower"
    ;; "Shave"
    ;; "Walk"
    "Lunch"
    "Dinner"
    ;; "Journal.*Journal"
    ;; "Journal.*Retrospective"
    ;; "Journal.*Gratitude"
    ;; "Debrief"
    ;; "Tidy: "
    "Diet: "
    "forsale mailing lists"
    ;; <= 5 minutes effort
    ;; " [12345]m "
    ;; No duration, no effort; brittle
    " \\([0-9]\\)?[0-9]:[0-9][0-9]\\.\\.\\.\\.\\.\\. \\(. \\)  "))
  ;; "List of headlines to dim in the org agenda view."
  ;; :type '(repeat string))

(defun cashpw/time-hh-mm-to-minutes (hh-mm)
  "Return number of minutes since midnight for HH-MM."
  (let ((decoded-time (parse-time-string hh-mm)))
    (+ (* 60 (decoded-time-hour decoded-time))
       (decoded-time-minute decoded-time))))

(defun cashpw/time-minutes-between-time-range (start-hh-mm end-hh-mm)
  "Return length of time between START-HH-MM and END-HH-MM."
  (let ((start-minutes (cashpw/time-hh-mm-to-minutes start-hh-mm))
        (end-minutes (cashpw/time-hh-mm-to-minutes end-hh-mm)))
    (- end-minutes start-minutes)))

(defconst cashpw/time-re-hh-mm-hh-mm
  (rx (group num num ":" num num) "-" (group num num ":" num num))
  "Matches HH:MM-HH:MM.")

(defun cashpw/org-agenda--maybe-dim-headline (line)
  "Dim LINE if it's on the list."
  (if (or
       ;; (when (string-match cashpw/time-re-hh-mm-hh-mm line)
       ;;   (< (cashpw/time-minutes-between-time-range
       ;;       (match-string 1 line) (match-string 2 line))
       ;;      5))
       (--any (string-match-p it line) cashpw/org-agenda--dim-headline-regexps))
      (cashpw/org-agenda--dim-line line)
    line))
#+end_src

