config/doom/tests.el
(ert-deftest cashpw/org-agenda-get-property-on-line-test ()
  "Test retrieving text properties anywhere on a line."
  (with-temp-buffer
    (insert "  Category:  Some Headline Text")
    (let ((beg (line-beginning-position))
          (end (line-end-position)))
      ;; Apply property to a sub-span
      (put-text-property (+ beg 5) (+ beg 15) 'effort-minutes 45)
      (put-text-property (+ beg 10) (+ beg 20) 'custom-prop "val")
      
      (goto-char beg)
      (should (equal (cashpw/org-agenda-get-property-on-line 'effort-minutes) 45))
      (should (equal (cashpw/org-agenda-get-property-on-line 'custom-prop) "val"))
      (should (null (cashpw/org-agenda-get-property-on-line 'non-existent)))
      
      ;; Move point to various positions on the line and ensure it still works
      (goto-char (+ beg 10))
      (should (equal (cashpw/org-agenda-get-property-on-line 'effort-minutes) 45))
      (goto-char (- end 1))
      (should (equal (cashpw/org-agenda-get-property-on-line 'effort-minutes) 45)))))

(ert-deftest cashpw/org-agenda-calculate-total-effort-test ()
  "Test summing effort-minutes in agenda buffer."
  (with-temp-buffer
    (insert "Line 1: Task A\n")
    (insert "Line 2: Task B\n")
    (insert "Line 3: Task C\n")
    
    ;; Apply effort-minutes and custom type properties
    (goto-char (point-min))
    ;; Line 1
    (let ((beg (line-beginning-position))
          (end (line-end-position)))
      (put-text-property (+ beg 2) (+ beg 10) 'effort-minutes 30)
      (put-text-property (+ beg 2) (+ beg 10) 'task-type "work"))
    
    (forward-line 1)
    ;; Line 2
    (let ((beg (line-beginning-position))
          (end (line-end-position)))
      (put-text-property (+ beg 2) (+ beg 10) 'effort-minutes 60)
      (put-text-property (+ beg 2) (+ beg 10) 'task-type "personal"))
    
    (forward-line 1)
    ;; Line 3
    (let ((beg (line-beginning-position))
          (end (line-end-position)))
      (put-text-property (+ beg 2) (+ beg 10) 'effort-minutes 15)
      (put-text-property (+ beg 2) (+ beg 10) 'task-type "work"))
    
    ;; Test total effort without predicate
    (should (equal (cashpw/org-agenda-calculate-total-effort) 105))
    
    ;; Test total effort with predicate (only "work" tasks)
    (should (equal (cashpw/org-agenda-calculate-total-effort
                    (lambda ()
                      (equal (cashpw/org-agenda-get-property-on-line 'task-type) "work")))
                   45))
    
    ;; Test total effort with predicate (only "personal" tasks)
    (should (equal (cashpw/org-agenda-calculate-total-effort
                    (lambda ()
                      (equal (cashpw/org-agenda-get-property-on-line 'task-type) "personal")))
                   60))

    ;; Test edge case 1: Predicate that moves point (Point Safety)
    (should (equal (cashpw/org-agenda-calculate-total-effort
                    (lambda ()
                      (goto-char (point-min))
                      t))
                   105))

    ;; Test edge case 2: Non-numeric / malformed effort values
    (with-temp-buffer
      (insert "Line 1: Bad Task\n")
      (insert "Line 2: Good Task\n")
      (goto-char (point-min))
      ;; Line 1: non-numeric effort property
      (let ((beg (line-beginning-position)))
        (put-text-property (+ beg 2) (+ beg 10) 'effort-minutes "invalid-string"))
      
      (forward-line 1)
      ;; Line 2: numeric effort property
      (let ((beg (line-beginning-position)))
        (put-text-property (+ beg 2) (+ beg 10) 'effort-minutes 30))
      
      ;; Should ignore the non-numeric effort and only sum the numeric one (30)
      (should (equal (cashpw/org-agenda-calculate-total-effort) 30)))))

(ert-deftest cashpw/org-agenda-display-planned-capacity-header-test ()
  "Test the capacity header injection, teardown, and safety logic."
  (let ((org-keys ".today")
        (cashpw-org-agenda-daily-capacity-hours 6.0))
    ;; 1. Happy Path
    (with-temp-buffer
      (insert "Today's Schedule\n")
      (insert "  Task 1 (scheduled today)\n")
      (insert "  Task 2 (not scheduled, weekly priority backlog)\n")
      
      ;; Apply properties to Task 1
      (goto-char (point-min))
      (forward-line 1)
      (let ((beg (line-beginning-position))
            (end (line-end-position)))
        (put-text-property beg end 'date "2026-05-26")
        (put-text-property beg end 'effort-minutes 120)) ; 2.0h
      
      ;; Apply properties to Task 2 (no date, but has effort)
      (forward-line 1)
      (let ((beg (line-beginning-position))
            (end (line-end-position)))
        (put-text-property beg end 'effort-minutes 180)) ; 3.0h (should be ignored)
      
      ;; Run injection
      (cashpw/org-agenda-display-planned-capacity-header)
      
      ;; Verify injection
      (goto-char (point-min))
      (should (re-search-forward "^Planned Today: 2\\.0h / 6\\.0h Capacity (33%)\n\n" nil t))
      ;; Verify the header carries the custom 'cashpw-header text property on the first char
      (should (get-text-property (point-min) 'cashpw-header))
      
      ;; 2. Idempotency / Teardown
      ;; Call it again. If teardown works, the header shouldn't be duplicated.
      (cashpw/org-agenda-display-planned-capacity-header)
      (goto-char (point-min))
      ;; Count matches of the header
      (let ((matches 0))
        (while (re-search-forward "^Planned Today: 2\\.0h / 6\\.0h Capacity (33%)\n\n" nil t)
          (setq matches (1+ matches)))
        (should (equal matches 1))))
    
    ;; 3. No-Op Buffer (when org-keys is different)
    (let ((org-keys ".other-view"))
      (with-temp-buffer
        (insert "Today's Schedule\n")
        (insert "  Task 1\n")
        (goto-char (point-min))
        (forward-line 1)
        (let ((beg (line-beginning-position))
              (end (line-end-position)))
          (put-text-property beg end 'date "2026-05-26")
          (put-text-property beg end 'effort-minutes 120))
        
        (cashpw/org-agenda-display-planned-capacity-header)
        ;; Verify NO header is injected
        (goto-char (point-min))
        (should-not (re-search-forward "^Planned Today:" nil t))))))

(ert-deftest cashpw/org-agenda-item-tags-marker-fallback-test ()
  "Verify marker-based fallback path when 'tags property is absent."
  (with-temp-buffer
    (org-mode)
    (insert "* Task :work:personal:\n")
    (let* ((marker (copy-marker (point-min)))
           (item (propertize "Task" 'org-marker marker)))
      (should (equal (cashpw/org-agenda-item-tags item) '("work" "personal"))))))

(ert-deftest cashpw/org-agenda-item-has-week-tag-p-test ()
  "Verify cashpw/org-agenda-item-has-week-tag-p detects YYYYwWW tags."
  (let ((item-with-week-tag (propertize "Task 1" 'tags '("work" "2026w22")))
        (item-without-week-tag (propertize "Task 2" 'tags '("work" "personal")))
        (item-with-malformed-tag (propertize "Task 3" 'tags '("2026w2" "2026w222"))))
    (should (cashpw/org-agenda-item-has-week-tag-p item-with-week-tag))
    (should-not (cashpw/org-agenda-item-has-week-tag-p item-without-week-tag))
    (should-not (cashpw/org-agenda-item-has-week-tag-p item-with-malformed-tag))))

(ert-deftest cashpw/org-agenda-item-future-week-p-test ()
  "Verify cashpw/org-agenda-item-future-week-p compares tags lexicographically."
  (cl-letf (((symbol-function 'cashpw-time-next-week-tag)
             (lambda () "2026w23")))
    (let ((item-past (propertize "Past" 'tags '("2026w22")))
          (item-current (propertize "Current" 'tags '("2026w23")))
          (item-future (propertize "Future" 'tags '("2026w24")))
          (item-no-tag (propertize "No Tag" 'tags '("work"))))
      (should-not (cashpw/org-agenda-item-future-week-p item-past))
      (should-not (cashpw/org-agenda-item-future-week-p item-current))
      (should (cashpw/org-agenda-item-future-week-p item-future))
      (should-not (cashpw/org-agenda-item-future-week-p item-no-tag)))))

(ert-deftest cashpw/org-agenda-current-line-tags-marker-fallback-test ()
  "Verify cashpw/org-agenda-current-line-tags marker-based fallback path."
  (with-temp-buffer
    (org-mode)
    (insert "* Task :work:personal:\n")
    (let ((marker (copy-marker (point-min))))
      (with-temp-buffer
        (insert "  Task\n")
        (put-text-property (point-min) (line-end-position) 'org-marker marker)
        (goto-char (point-min))
        (should (equal (cashpw/org-agenda-current-line-tags) '("work" "personal")))))))

(ert-deftest cashpw/org-agenda-view--plan--week-test ()
  "Verify the structural correctness of the custom Week Planner view."
  (cl-letf (((symbol-function 'cashpw-time-current-week-tag)
             (lambda () "2026w22"))
            ((symbol-function 'cashpw-time-next-week-tag)
             (lambda () "2026w23")))
    (let* ((view (cashpw/org-agenda-view--plan--week))
           (block (car view))
           (type (car block))
           (opts (caddr block))
           (groups-raw (cadr (assoc 'org-super-agenda-groups opts)))
           (groups (if (eq (car groups-raw) '\`) (cadr groups-raw) groups-raw))
           (eval-val (lambda (val)
                       (if (and (listp val) (eq (car val) '\,))
                           (eval (cadr val))
                         val))))
      ;; 1. Outer structure is a list of length 1 containing alltodo command
      (should (equal (length view) 1))
      (should (equal type 'alltodo))
      ;; 2. Header is correct
      (should (equal (cadr (assoc 'org-agenda-overriding-header opts)) "Week Planner & Backlog Board"))
      ;; 3. Groups structure matches spec (indices shifted by 1 due to prepended PROJ discard group)
      (should (plist-get (nth 0 groups) :discard))
      (should (equal (plist-get (nth 1 groups) :name) "This Week"))
      (should (equal (funcall eval-val (plist-get (nth 1 groups) :tag)) "2026w22"))
      
      (should (equal (plist-get (nth 2 groups) :name) "Next Week"))
      (should (equal (funcall eval-val (plist-get (nth 2 groups) :tag)) "2026w23"))
      
      (should (equal (plist-get (nth 3 groups) :name) "Future Weeks"))
      (should (equal (plist-get (nth 3 groups) :pred) 'cashpw/org-agenda-item-future-week-p))
      
      (should (equal (plist-get (nth 4 groups) :name) "Unassigned Backlog"))
      (should (equal (plist-get (nth 4 groups) :and)
                      '(:todo t
                        :not (:scheduled t)
                        :not (:deadline t)
                        :not (:tag "unscheduled")
                        :not (:pred cashpw/org-agenda-item-has-week-tag-p))))
      
      (should (plist-get (nth 5 groups) :discard)))))

(ert-deftest cashpw/org-agenda-display-planned-capacity-header-weekly-test ()
  "Test the weekly capacity header injection, filtering, and safety logic."
  (cl-letf (((symbol-function 'cashpw-time-current-week-tag)
             (lambda () "2026w22"))
            ((symbol-function 'cashpw-time-next-week-tag)
             (lambda () "2026w23")))
    (let ((org-keys ".plan-week")
          (cashpw-org-agenda-weekly-capacity-hours 30.0))
      (with-temp-buffer
        (insert "Week Planner & Backlog Board\n")
        (insert "  Task 1 (this week)\n")
        (insert "  Task 2 (next week)\n")

        ;; Apply properties and current week tag to Task 1
        (goto-char (point-min))
        (forward-line 1)
        (let ((beg (line-beginning-position))
              (end (line-end-position)))
          (put-text-property beg end 'effort-minutes 300)
          (put-text-property beg end 'tags '("2026w22"))) ; 5.0h

        ;; Apply properties and next week tag to Task 2
        (forward-line 1)
        (let ((beg (line-beginning-position))
              (end (line-end-position)))
          (put-text-property beg end 'effort-minutes 600)
          (put-text-property beg end 'tags '("2026w23"))) ; 10.0h

        ;; Run injection
        (cashpw/org-agenda-display-planned-capacity-header)

        ;; Verify injection (should only sum Task 1)
        (goto-char (point-min))
        (should (re-search-forward "^Planned This Week: 5\\.0h / 30\\.0h Capacity (17% of Weekly Limit)\n\n" nil t))
        (should (get-text-property (point-min) 'cashpw-header))

        ;; Verify idempotency
        (cashpw/org-agenda-display-planned-capacity-header)
        (goto-char (point-min))
        (let ((matches 0))
          (while (re-search-forward "^Planned This Week: 5\\.0h" nil t)
            (setq matches (1+ matches)))
          (should (equal matches 1)))))))

(ert-deftest cashpw/org-agenda-display-planned-capacity-header-weekly-zero-capacity-test ()
  "Verify that a weekly capacity of 0.0 is handled safely without division by zero."
  (cl-letf (((symbol-function 'cashpw-time-current-week-tag)
             (lambda () "2026w22"))
            ((symbol-function 'cashpw-time-next-week-tag)
             (lambda () "2026w23")))
    (let ((org-keys ".plan-week")
          (cashpw-org-agenda-weekly-capacity-hours 0.0))
      (with-temp-buffer
        (insert "Week Planner & Backlog Board\n")
        (insert "  Task 1 (this week)\n")
        (goto-char (point-min))
        (forward-line 1)
        (let ((beg (line-beginning-position))
              (end (line-end-position)))
          (put-text-property beg end 'effort-minutes 300)
          (put-text-property beg end 'tags '("2026w22"))) ; 5.0h
        
        (cashpw/org-agenda-display-planned-capacity-header)
        
        (goto-char (point-min))
        (should (re-search-forward "^Planned This Week: 5\\.0h / 0\\.0h Capacity (0% of Weekly Limit)\n\n" nil t))))))

(ert-deftest cashpw/org-agenda-display-planned-capacity-header-weekly-isolation-test ()
  "Verify that no capacity header is injected when org-keys is set to an unrelated view."
  (let ((org-keys ".other-view")
        (cashpw-org-agenda-weekly-capacity-hours 30.0))
    (with-temp-buffer
      (insert "Some Other Board\n")
      (insert "  Task 1\n")
      
      (cashpw/org-agenda-display-planned-capacity-header)
      
      (goto-char (point-min))
      (should-not (re-search-forward "^Planned" nil t)))))
