config/doom/config-personal-org-agenda.org
*** Backlog triage
Helper functions and keybindings to quickly assign tasks in the agenda to specific weeks.

- `w .` :: Assign entry at point to the current week (`cashpw/org-agenda-assign-to-this-week`)
- `w n` :: Assign entry at point to the next week (`cashpw/org-agenda-assign-to-next-week`)
- `w w` :: Assign entry at point to a custom week (`cashpw/org-agenda-assign-to-week`)

#+begin_src emacs-lisp :tangle config-personal.el :results none
(defun cashpw/org-agenda-update-week-tags (current-tags week-tag)
  "Return CURRENT-TAGS with old week tags removed and WEEK-TAG added if non-nil/non-empty.
WEEK-TAG must match YYYYwWW format if provided."
  (when (and week-tag (not (string-empty-p week-tag))
             (not (string-match-p "^[0-9]\\{4\\}w[0-9]\\{2\\}$" week-tag)))
    (user-error "Invalid week tag format: %s. Expected YYYYwWW" week-tag))
  ;; Remove any existing week tags matching YYYYwWW format (e.g., 2026w21)
  (let ((clean-tags (--remove (string-match-p "^[0-9]\\{4\\}w[0-9]\\{2\\}$" it) current-tags)))
    (if (and week-tag (not (string-empty-p week-tag)))
        (append clean-tags (list week-tag))
      clean-tags)))

(defun cashpw/org-agenda-assign-to-week (week-tag)
  "Assign the entry at point to the specified WEEK-TAG, cleaning out old week tags."
  (interactive (list (read-string "Week (YYYYwWW): " (cashpw-time-current-week-tag))))
  (let* ((marker (or (get-text-property (point) 'org-marker)
                     (user-error "No entry at point")))
         (buffer (marker-buffer marker))
         (pos (marker-position marker)))
    (unless (and buffer (buffer-live-p buffer))
      (user-error "Marker points to an invalid or killed buffer"))
    (with-current-buffer buffer
      (save-excursion
        (goto-char pos)
        (org-set-tags (cashpw/org-agenda-update-week-tags (org-get-tags nil 'local) week-tag))
        (org-todo-trigger-tag-changes nil)))
    (org-agenda-redo)))

(defun cashpw/org-agenda-assign-to-this-week ()
  "Assign entry at point to this week."
  (interactive)
  (cashpw/org-agenda-assign-to-week (cashpw-time-current-week-tag)))

(defun cashpw/org-agenda-assign-to-next-week ()
  "Assign entry at point to next week."
  (interactive)
  (cashpw/org-agenda-assign-to-week (cashpw-time-next-week-tag)))

(after! evil-org-agenda
  (map! :map evil-org-agenda-mode-map
        :m "w" nil ;; Unbind word motion in agenda
        (:prefix ("w" . "Assign to week")
         :m "." #'cashpw/org-agenda-assign-to-this-week
         :m "n" #'cashpw/org-agenda-assign-to-next-week
         :m "w" #'cashpw/org-agenda-assign-to-week)))

(defun cashpw/org-agenda-bulk-assign-to-week (week-tag)
  "Bulk assign marked entries to WEEK-TAG."
  (org-agenda-with-point-at-orig-entry nil
    (org-set-tags (cashpw/org-agenda-update-week-tags (org-get-tags nil 'local) week-tag))
    (org-todo-trigger-tag-changes nil)))

(defun cashpw/org-agenda-bulk-assign-to-week-arg ()
  "Prompt for week assignment arguments during bulk action."
  (let* ((key (read-char-choice "Assign marked to week: [.] This week, [n] Next week, [w] Custom week" '(?\. ?n ?w)))
         (week-tag (cond
                    ((= key ?\.) (cashpw-time-current-week-tag))
                    ((= key ?n) (cashpw-time-next-week-tag))
                    ((= key ?w) (read-string "Week (YYYYwWW): " (cashpw-time-current-week-tag))))))
    (list week-tag)))
#+end_src

#+begin_src emacs-lisp :tangle tests.el
(ert-deftest cashpw/org-agenda-update-week-tags-test ()
  "Test tag updates using cashpw/org-agenda-update-week-tags."
  ;; 1. Add a new week tag (replaces existing week tag)
  (should (equal (cashpw/org-agenda-update-week-tags '("work" "2026w21") "2026w22")
                 '("work" "2026w22")))
  ;; 2. Empty week tag removes existing week tag
  (should (equal (cashpw/org-agenda-update-week-tags '("work" "2026w21") "")
                 '("work")))
  ;; 3. Nil week tag removes existing week tag
  (should (equal (cashpw/org-agenda-update-week-tags '("work" "2026w21") nil)
                 '("work")))
  ;; 4. Invalid week tag signals a user-error
  (should-error (cashpw/org-agenda-update-week-tags '("work") "invalid-week")
                :type 'user-error))

(ert-deftest cashpw/org-agenda-assign-to-week-replaces-existing-week-tag ()
  "Test that assigning a new week tag replaces the existing week tag on the entry at point."
  (with-temp-buffer
    (org-mode)
    (insert "* TODO Task 1 :work:2026w21:\n")
    (let ((marker (copy-marker (point-min))))
      (cl-letf (((symbol-function 'org-agenda-redo) #'ignore))
        (with-temp-buffer
          (insert "  Task 1\n")
          (put-text-property (point-min) (line-end-position) 'org-marker marker)
          (goto-char (point-min))
          (cashpw/org-agenda-assign-to-week "2026w22")
          (with-current-buffer (marker-buffer marker)
            (org-with-point-at marker
              (should (equal (org-get-tags) '("work" "2026w22"))))))))))

(ert-deftest cashpw/org-agenda-assign-to-week-removes-tag-when-empty ()
  "Test that assigning an empty string removes any existing week tag."
  (with-temp-buffer
    (org-mode)
    (insert "* TODO Task 1 :work:2026w21:\n")
    (let ((marker (copy-marker (point-min))))
      (cl-letf (((symbol-function 'org-agenda-redo) #'ignore))
        (with-temp-buffer
          (insert "  Task 1\n")
          (put-text-property (point-min) (line-end-position) 'org-marker marker)
          (goto-char (point-min))
          (cashpw/org-agenda-assign-to-week "")
          (with-current-buffer (marker-buffer marker)
            (org-with-point-at marker
              (should (equal (org-get-tags) '("work"))))))))))

(ert-deftest cashpw/org-agenda-assign-to-week-removes-tag-when-nil ()
  "Test that assigning nil removes any existing week tag."
  (with-temp-buffer
    (org-mode)
    (insert "* TODO Task 1 :work:2026w21:\n")
    (let ((marker (copy-marker (point-min))))
      (cl-letf (((symbol-function 'org-agenda-redo) #'ignore))
        (with-temp-buffer
          (insert "  Task 1\n")
          (put-text-property (point-min) (line-end-position) 'org-marker marker)
          (goto-char (point-min))
          (cashpw/org-agenda-assign-to-week nil)
          (with-current-buffer (marker-buffer marker)
            (org-with-point-at marker
              (should (equal (org-get-tags) '("work"))))))))))

(ert-deftest cashpw/org-agenda-assign-to-week-preserves-inherited-tags ()
  "Test that assigning a week tag does NOT convert inherited tags into local tags."
  (with-temp-buffer
    (org-mode)
    ;; Parent heading with :noexport: tag
    (insert "* Parent :noexport:\n")
    ;; Child heading (Task 1) with local :work: tag
    (insert "** TODO Task 1 :work:2026w21:\n")
    (let ((marker (copy-marker (line-beginning-position 0))))
      (cl-letf (((symbol-function 'org-agenda-redo) #'ignore))
        (with-temp-buffer
          (insert "  Task 1\n")
          (put-text-property (point-min) (line-end-position) 'org-marker marker)
          (goto-char (point-min))
          (cashpw/org-agenda-assign-to-week "2026w22")
          (with-current-buffer (marker-buffer marker)
            (org-with-point-at marker
              ;; Local tags should only be "work" and "2026w22". "noexport" should NOT be here locally!
              (should (equal (org-get-tags nil 'local) '("work" "2026w22")))
              ;; But it should still be inherited globally
              (should (member "noexport" (org-get-tags))))))))))

(ert-deftest cashpw/org-agenda-assign-to-week-no-marker-test ()
  "Test that cashpw/org-agenda-assign-to-week fails gracefully with a user-error if no marker is present."
  (with-temp-buffer
    (insert "  Task without marker\n")
    (goto-char (point-min))
    (should-error (cashpw/org-agenda-assign-to-week "2026w22") :type 'user-error)))

(ert-deftest cashpw/org-agenda-assign-to-week-invalid-marker-test ()
  "Test that cashpw/org-agenda-assign-to-week fails gracefully with a user-error if marker points to a dead buffer."
  (let ((marker (make-marker)))
    (with-temp-buffer
      (insert "  Task with dead marker\n")
      (put-text-property (point-min) (line-end-position) 'org-marker marker)
      (goto-char (point-min))
      (should-error (cashpw/org-agenda-assign-to-week "2026w22") :type 'user-error))))

(ert-deftest cashpw/org-agenda-assign-to-this-week-test ()
  "Test that cashpw/org-agenda-assign-to-this-week assigns the current week tag."
  (with-temp-buffer
    (org-mode)
    (insert "* TODO Task 1 :work:\n")
    (let ((marker (copy-marker (point-min))))
      (cl-letf (((symbol-function 'org-agenda-redo) #'ignore)
                ((symbol-function 'cashpw-time-current-week-tag) (lambda () "2026w22")))
        (with-temp-buffer
          (insert "  Task 1\n")
          (put-text-property (point-min) (line-end-position) 'org-marker marker)
          (goto-char (point-min))
          (cashpw/org-agenda-assign-to-this-week)
          (with-current-buffer (marker-buffer marker)
            (org-with-point-at marker
              (should (equal (org-get-tags) '("work" "2026w22"))))))))))

(ert-deftest cashpw/org-agenda-assign-to-next-week-test ()
  "Test that cashpw/org-agenda-assign-to-next-week assigns the next week tag."
  (with-temp-buffer
    (org-mode)
    (insert "* TODO Task 1 :work:\n")
    (let ((marker (copy-marker (point-min))))
      (cl-letf (((symbol-function 'org-agenda-redo) #'ignore)
                ((symbol-function 'cashpw-time-next-week-tag) (lambda () "2026w23")))
        (with-temp-buffer
          (insert "  Task 1\n")
          (put-text-property (point-min) (line-end-position) 'org-marker marker)
          (goto-char (point-min))
          (cashpw/org-agenda-assign-to-next-week)
          (with-current-buffer (marker-buffer marker)
            (org-with-point-at marker
              (should (equal (org-get-tags) '("work" "2026w23"))))))))))

(ert-deftest cashpw/work-buganizer-check-on-state-change-bypass-test ()
  "Test that declining the Buganizer prompt tags the entry with 'needs_bug'."
  (with-temp-buffer
    (org-mode)
    (insert "* TODO Test Task\n")
    (goto-char (point-min))
    (let ((org-state "INPROGRESS")
          (noninteractive nil)
          (called-add-bug nil))
      (cl-letf (((symbol-function 'y-or-n-p) (lambda (_) nil))
                ((symbol-function 'org-buganizer-add-bug-to-entry) (lambda () (interactive) (setq called-add-bug t))))
        (cashpw/work-buganizer-check-on-state-change)
        (should-not called-add-bug)
        (should (member "needs_bug" (org-get-tags)))))))

(ert-deftest cashpw/work-buganizer-check-on-state-change-link-test ()
  "Test that accepting the Buganizer prompt calls `org-buganizer-add-bug-to-entry'."
  (with-temp-buffer
    (org-mode)
    (insert "* TODO Test Task\n")
    (goto-char (point-min))
    (let ((org-state "INPROGRESS")
          (noninteractive nil)
          (called-add-bug nil))
      (cl-letf (((symbol-function 'y-or-n-p) (lambda (_) t))
                ((symbol-function 'org-buganizer-add-bug-to-entry) (lambda () (interactive) (setq called-add-bug t))))
        (cashpw/work-buganizer-check-on-state-change)
        (should called-add-bug)
        (should-not (member "needs_bug" (org-get-tags)))))))

(ert-deftest cashpw/work-buganizer-check-on-state-change-noop-test ()
  "Test that when buganizer_id is already present, no prompts are shown and no tags are added."
  (with-temp-buffer
    (org-mode)
    (insert "* TODO Test Task\n  :PROPERTIES:\n  :buganizer_id: 12345\n  :END:\n")
    (goto-char (point-min))
    (let ((org-state "INPROGRESS")
          (called-y-or-n nil)
          (called-add-bug nil))
      (cl-letf (((symbol-function 'y-or-n-p) (lambda (_) (setq called-y-or-n t) nil))
                ((symbol-function 'org-buganizer-add-bug-to-entry) (lambda () (interactive) (setq called-add-bug t))))
        (cashpw/work-buganizer-check-on-state-change)
        (should-not called-y-or-n)
        (should-not called-add-bug)
        (should-not (member "needs_bug" (org-get-tags)))))))

(ert-deftest cashpw/work-buganizer-check-on-state-change-wrong-state-test ()
  "Test that transitioning to a state other than 'INPROGRESS' does nothing."
  (with-temp-buffer
    (org-mode)
    (insert "* TODO Test Task\n")
    (goto-char (point-min))
    (let ((org-state "WAITING")
          (called-y-or-n nil)
          (called-add-bug nil))
      (cl-letf (((symbol-function 'y-or-n-p) (lambda (_) (setq called-y-or-n t) nil))
                ((symbol-function 'org-buganizer-add-bug-to-entry) (lambda () (interactive) (setq called-add-bug t))))
        (cashpw/work-buganizer-check-on-state-change)
        (should-not called-y-or-n)
        (should-not called-add-bug)
        (should-not (member "needs_bug" (org-get-tags)))))))
#+end_src

#+RESULTS:
: cashpw/work-buganizer-check-on-state-change-wrong-state-test

