config/doom/config-personal-org-agenda.org
*** Unscheduled
#+begin_src emacs-lisp :tangle config-personal.el :results none
(defun cashpw/org-agenda-view--not-scheduled ()
  "Return custom agenda command."
  `((alltodo
     ""
     ((org-agenda-overriding-header "")
      (org-agenda-files (cashpw/org-agenda-files--update))
      (org-agenda-sorting-strategy '((todo category-up alpha-up)))
      ;; (org-agenda-cmp-user-defined
      ;;  (lambda (a b)
      ;;    (let* ((a-priority-or-nil
      ;;            (org-extras-get-priority
      ;;             (get-text-property 0 'org-hd-marker a)))
      ;;           (a-priority
      ;;            (string-to-number
      ;;             (or a-priority-or-nil
      ;;                 (number-to-string (1+ org-priority-lowest)))))
      ;;           (b-priority-or-nil
      ;;            (org-extras-get-priority
      ;;             (get-text-property 0 'org-hd-marker b)))
      ;;           (b-priority
      ;;            (string-to-number
      ;;             (or b-priority-or-nil
      ;;                 (number-to-string (1+ org-priority-lowest))))))
      ;;      (if (> a-priority b-priority)
      ;;          1
      ;;        -1))))
                                        ;(org-agenda-sorting-strategy '((todo . (user-defined-up))))
      (org-super-agenda-groups
       '(( ;; Automatically named "Log"
          :log
          t)
         (:discard
          ( ;; Don't bother listing PROJ items. They are used to group actionable TODOs.
           :todo "PROJ"
           :tag ("unscheduled" "everyday")))
         (:discard (:scheduled t))
         ;; (:auto-category t)
         (:auto-map cashpw/org-super-agenda--get-priority
          :transformer cashpw/org-super-agenda--simplify-map)
         ))))))

(defun cashpw/org-agenda-view--not-scheduled-by-priority ()
  "Return custom agenda command."
  `((alltodo
     ""
     ((org-agenda-overriding-header "")
      (org-agenda-files (cashpw/org-agenda-files--update))
      (org-agenda-cmp-user-defined
       (lambda (a b)
         (let* ((a-priority-or-nil
                 (org-extras-get-priority
                  (get-text-property 0 'org-hd-marker a)))
                (a-priority
                 (string-to-number
                  (or a-priority-or-nil
                      (number-to-string (1+ org-priority-lowest)))))
                (b-priority-or-nil
                 (org-extras-get-priority
                  (get-text-property 0 'org-hd-marker b)))
                (b-priority
                 (string-to-number
                  (or b-priority-or-nil
                      (number-to-string (1+ org-priority-lowest))))))
           (if (> a-priority b-priority)
               1
             -1))))
      (org-agenda-sorting-strategy '((todo . (user-defined-up))))
      (org-super-agenda-groups
       '(( ;; Automatically named "Log"
          :log
          t)
         (:discard
          ( ;; Don't bother listing PROJ items. They are used to group actionable TODOs.
           :todo "PROJ"
           :tag ("unscheduled" "everyday")))
         (:discard (:scheduled t))
         (:auto-map cashpw/org-super-agenda--get-priority
          :transformer cashpw/org-super-agenda--simplify-map)))))))

(cashpw/org-agenda-custom-commands--maybe-update)
#+end_src

*** Overdue

#+begin_src emacs-lisp :tangle config-personal.el :results none
(defun cashpw/org-agenda-view--overdue--files ()
  "Return a list of files containing overdue tasks."
  (let ((org-not-done-keywords
         (with-temp-buffer
           (org-mode)
           org-not-done-keywords)))
    (cl-loop
     for file in (org-mem-all-files) unless (s-ends-with-p "archive" file) when
     (seq-find
      (lambda (entry)
        (and (member (org-mem-entry-todo-state entry) org-not-done-keywords)
             (or (and (org-mem-entry-scheduled entry)
                      (cashpw-time-past-p
                       (encode-time
                        (parse-time-string (org-mem-entry-scheduled entry)))))
                 (and (org-mem-entry-deadline entry)
                      (cashpw-time-past-p
                       (encode-time
                        (parse-time-string (org-mem-entry-deadline entry))))))))
      (org-mem-entries-in file))
     collect file)))

(defun cashpw/org-agenda-view--overdue ()
  "Return custom agenda command."
  `((agenda
     ""
     ((org-agenda-overriding-header "")
      (org-agenda-span 1)
      (org-agenda-files (cashpw/org-agenda-view--overdue--files))
      (org-super-agenda-groups
       '((:discard
          (:scheduled
           future
           :deadline future
           :scheduled today
           :deadline today
           :file-path ,(cashpw/path-calendar)))
         (:auto-map
          (lambda (item)
            (-when-let* ((marker
                          (or (get-text-property 0 'org-marker item)
                              (get-text-property 0 'org-hd-marker)))
                         (default-priority "?")
                         (priority
                          (or (org-extras-get-priority marker)
                              default-priority)))
              (cond
               ((org-extras-scheduled-to-repeat-daily-p marker)
                "1 Repeats daily")
               ((org-extras-scheduled-to-repeat-weekly-p marker)
                "2 Repeats weekly")
               ((org-extras-scheduled-to-repeat-p marker)
                "3 Repeats")
               (t
                "4 Doesn't repeat")))))
         ( ;; Toss all other todos
          :discard
          (:todo t))))))))

(cashpw/org-agenda-custom-commands--maybe-update)
#+end_src

*** Gallery

#+begin_src emacs-lisp :tangle config-personal.el :results none
(defun cashpw/cmp-random (a b)
  "Return 1 or -1 randomly for sorting entries A and B."
  (if (> 0.5 (random))
      1
    -1))

(defun cashpw/org-agenda-view--gallery ()
  "Return custom agenda command."
  `((tags
     ""
     ((org-agenda-overriding-header "")
      (org-agenda-files (cashpw/org-files-with-tag "has_gallery" cashpw/path--notes-dir))
      (org-super-agenda-groups
       '((:name "Gallery"
          :todo nil)
         (:discard (:anything))))))))

(defun cashpw/org-agenda-view--gallery-all ()
  "Return custom agenda command."
  `((tags
     "gallery"
     ((org-agenda-overriding-header "")
      (org-agenda-files (cashpw/org-files-with-tag "has_gallery" cashpw/path--notes-dir))
      (org-super-agenda-groups
       '((:name "Gallery"
          :todo nil)
         (:discard (:anything))))))))

(defun cashpw/org-agenda-view--gallery-photos ()
  "Return custom agenda command."
  `((tags
     "photo"
     ((org-agenda-overriding-header "")
      (org-agenda-files (cashpw/org-files-with-tag "has_gallery" cashpw/path--notes-dir))
      (org-super-agenda-groups
       '((:name "Gallery"
          :todo nil)
         (:discard (:anything))))))))

(defun cashpw/org-agenda-view--gallery-current-buffer ()
  "Return custom agenda command."
  `((tags
     "gallery"
     ((org-agenda-overriding-header "")
      (org-agenda-files (list cashpw/gallery-file-name))
      (org-super-agenda-groups
       '((:name "Gallery"
          :todo nil)
         (:discard (:anything))))))))

(cashpw/org-agenda-custom-commands--maybe-update)
#+end_src

*** Set

#+begin_src emacs-lisp :tangle config-personal.el :results none
(cashpw/org-agenda-custom-commands--update)
#+end_src

** Corporate

#+begin_src emacs-lisp :tangle config-personal.el :results none
(defun cashpw/org-agenda-buganizer-title ()
  "Overridden in my work config."
  "")
#+end_src

** Keybindings

#+begin_src emacs-lisp :tangle config-personal.el :results none
(after! org-agenda
  (define-key org-agenda-mode-map (kbd "@") #'cashpw/org-agenda-view-toggle-collapse)
  ;; Override
  (define-key org-agenda-mode-map (kbd ".") #'cashpw/org-agenda-reschedule-to-today)
  (define-key org-agenda-mode-map (kbd ">") #'cashpw/org-agenda-reschedule-to-next-occurrence-or-kill))
#+end_src
* =org-clock=

#+begin_src emacs-lisp :tangle config-personal.el :results none
(defun cashpw/org-clock--agenda-with-archives ()
  "Return list of agenda files to use with clocktable."
  (append
   `(,cashpw/path--sleep-calendar)
   (cashpw/org-agenda-files 'personal t)
   (cashpw/org-agenda-files 'calendar t)
   (cashpw/org-agenda-files 'journal-this-year t)
   (cashpw/org-agenda-files 'people-private t)))

(defun cashpw/org-set-inprogress-to-todo ()
  "Set the current heading's todo status to TODO if it's currently INPROGRESS."
  (when (string= "INPROGRESS" (org-get-todo-state))
    (org-todo "TODO")))

(after! org
  (setq
   ;; Prevent org-clock from double-checking /every/ agenda file for dangling clock during `org-clock-in'.
   ;; See https://github.com/doomemacs/doomemacs/issues/5317
   org-clock-auto-clock-resolution nil)
  (add-to-list 'org-clock-out-hook #'cashpw/org-set-inprogress-to-todo))
#+end_src

** Manual clock entry

#+begin_src emacs-lisp :tangle config-personal.el :results none
(defun cashpw/org-clock-add-entry (clock-in-time clock-out-time)
  "Add single clock entry.

Clock in at CLOCK-IN-TIME and clock out at CLOCK-OUT-TIME."
  (interactive
   (list
    (org-read-date t t nil "Clock in")
    (org-read-date t t nil "Clock out")))
  (org-clock-in nil clock-in-time)
  (org-clock-out nil nil clock-out-time))
#+end_src

** Untracked time

#+begin_src emacs-lisp :tangle config-personal.el :results none
(defun cashpw/org-clock-duration-in-minutes (&optional arg)
  "Return total clocked minutes.

Based on `org-clock-display'.

By default, show the total time for the range defined in
`org-clock-display-default-range'.  With `\\[universal-argument]' \
ARG prefix, show
the total time for today instead.

With `\\[universal-argument] \\[universal-argument]' ARG prefix, \
use a custom range, entered at prompt.

With `\\[universal-argument] \ \\[universal-argument] \
\\[universal-argument]' ARG prefix, display the total time in the
echo area.

Use `\\[org-clock-remove-overlays]' to remove the subtree times."
  (interactive "P")
  (org-clock-remove-overlays)
  (let* ((todayp (equal arg '(4)))
         (customp (member arg '((16) today yesterday
                                thisweek lastweek thismonth
                                lastmonth thisyear lastyear
                                untilnow interactive)))
         (prop (cond ((not arg) :org-clock-minutes-default)
                     (todayp :org-clock-minutes-today)
                     (customp :org-clock-minutes-custom)
                     (t :org-clock-minutes))))
    (cond ((not arg) (org-clock-sum-custom
                      nil org-clock-display-default-range prop))
          (todayp (org-clock-sum-today))
          (customp (org-clock-sum-custom nil arg))
          (t (org-clock-sum)))
    (unless (equal arg '(64))
      (save-excursion
        (goto-char (point-min))
        (let ((p nil))
          (while (or (and (equal (setq p (point)) (point-min))
                          (get-text-property p prop))
                     (setq p (next-single-property-change (point) prop)))
            (goto-char p)
            (let ((time (get-text-property p prop)))
              (when time (org-clock-put-overlay time)))))
        ;; Arrange to remove the overlays upon next change.
        (when org-remove-highlights-with-change
          (add-hook 'before-change-functions #'org-clock-remove-overlays
                    nil 'local))))
    org-clock-file-total-minutes))

(defun cashpw/org-clock-clocked-minutes (&optional key)
  "Return the total clocked minutes for KEY.

See `org-clock-special-range' for KEY."
  (interactive)
  (let ((key (or key
                 'interactive))
        (total-minutes
         0)
        (special-range (org-clock-special-range key))
        (org-clock-display-default-range
         'interactive))
    ;; Avoid a prompt from `org-clock-special-range' for every file by hard-coding a response.
    (cl-letf (((symbol-function 'org-clock-special-range)
               (lambda (_key &optional _time _as-strings _wstart _mstart)
                 special-range)))
      (dolist (file (cashpw/org-clock--agenda-with-archives))
        (with-current-buffer
            (find-file-noselect
             file)
          (setq
           total-minutes (+ total-minutes
                            (or (cashpw/org-clock-duration-in-minutes)
                                0)))))
      total-minutes)))

(defun cashpw/org-clock-clocked-minutes-for-time-range (start-time end-time)
  "Return clocked minutes between START-TIME and END-TIME."
  (let* ((org-read-date-counter -1))
    (cl-letf (((symbol-function 'org-read-date)
               (lambda (&optional
                   _with-time
                   _to-time
                   _from-string
                   _prompt
                   _default-time
                   _default-input
                   _inactive)
                 (cl-incf org-read-date-counter)
                 (cond
                  ((= org-read-date-counter
                      0)
                   start-time)
                  ((= org-read-date-counter
                      1)
                   end-time)))))
      (cashpw/org-clock-clocked-minutes 'interactive))))

(defun cashpw/org-clock-non-clocked-minutes (&optional key)
  "Return the total non-clocked minutes for a selected date range determined by KEY."
  (interactive)
  (let ((key
         (or key
             'interactive))
        (minutes-in-day
         (* 24
            60)))
    (- minutes-in-day
       (cashpw/org-clock-clocked-minutes
        key))))

(defun cashpw/org-clock-clocked-minutes-today ()
  "Return the number of minutes clocked today."
  (interactive)
  (cashpw/org-clock-clocked-minutes 'today))

(defun cashpw/org-clock-non-clocked-minutes-today ()
  "Return the number of minutes not clocked today."
  (interactive)
  (cashpw/org-clock-non-clocked-minutes 'today))
#+end_src

#+begin_src emacs-lisp
(cashpw/org-clock-clocked-minutes-for-time-range
 (date-to-time "2024-04-03")
 (date-to-time "2024-04-04"))
#+end_src

#+RESULTS:
: 568

** Reports
*** =clocktable=
#+begin_src emacs-lisp :tangle config-personal.el :results none
(defun cashpw/org-clock--clocktable--properties (time)
  "Return default clocktable properties for TIME."
  `(:scope
    cashpw/org-clock--agenda-with-archives
    :block ,(format-time-string "%Y-%m-%d" time)
    :narrow 200
    :fileskip0 t
    :filetitle t
    :maxlevel 3))

(defun cashpw/org-clock--clocktable-update-default-properties ()
  "Return default clocktable properties"
  (setq org-clock-clocktable-default-properties
        (cashpw/org-clock--clocktable--properties (current-time))))

(cashpw/org-clock--clocktable-update-default-properties)
;; Update the properties once per day as they include `:block' with today's date.
(let ((seconds-in-day (* 60 60 24)))
  (cancel-function-timers
   #'cashpw/org-clock--clocktable-update-default-properties)
  (run-at-time
   "00:00"
   seconds-in-day
   #'cashpw/org-clock--clocktable-update-default-properties))

(defun cashpw/org-clocktable-files-with-entries-at-yyyy-mm-dd (yyyy-mm-dd)
  "Return list of files with clock entries at YYYY-MM-DD."
  (cashpw/rgrep
   (format "-l \"\\[%s\" %s/*.org*" yyyy-mm-dd cashpw/path--notes-dir)))

(defun cashpw/org-clocktable-files-with-entries-at-yyyy-w (yyyy-w)
  "Return list of files with clock entries at YYYY-W."
  (if (string-match "\\([0-9]\\{4\\}\\)-W\\([0-9]\\{2\\}\\)" yyyy-w)
      (let ((year (string-to-number (match-string 1 yyyy-w)))
            (week (string-to-number (match-string 2 yyyy-w))))
        (-uniq
         (-reduce
          #'append
          (--map
           (cashpw/rgrep
            (format "-l \"\\[%s\" %s/*.org*"
                    (format-time-string "%F" it)
                    cashpw/path--notes-dir))
           (cashpw-time--get-week-times
            (cashpw-time-iso-week-to-time year week))))))
    (message "Failed to parse YYYY-W format: %s" yyyy-w)
    nil))
#+end_src

